FluidSolidInteraction/run/ampFsiFoam/axisymmetricTube/fluid/constant/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolver consistentIcoFluid;

unsIcoFluidCoeffs
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors 1;

    consistent no;
}

icoFluidCoeffs
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors 1;
}

consistentIcoFluidCoeffs
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 1;
}

// ************************************************************************* //
