FluidSolidInteraction/run/ampFsiFoam/axisymmetricTube/fluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type fixedValue;
        value uniform 0;
    }
    inlet
    {
        type timeVaryingUniformFixedValue;
        fileName "$FOAM_CASE/time-series";
        outOfBounds clamp;           // (error|warn|clamp|repeat)
        value uniform 0;
    }
    interface-fluid
    {
        type elasticWallPressure;
        value uniform 0;
    }
    wedge_p
    {
        type wedge;
    }
    wedge_n
    {
        type wedge;
    }
}
// ************************************************************************* //
